// task-1 - напишите пожалуйста ваши имя, фамилию и возраст в переменные
// выведите в консоль их значения и типы данных

// task-2 - создайте объект героя игры, который вам нравится и укажите ему следующие свойства и методы:

// name
// speed
// lifes
// score

// toShowName()

// и выведите в консоль этот объект и его метод

// task-3
// создадите массив из двух строчных элементов, одного объекта и 
// замените значения строчных элементов

// task-4
// напишите функцию, которая расчитает стоимость покупки трех любых продуктов 

// tast-5
// через команду prompt() получите имя пользователя и выведите сообщение
// с приветствием, но, если пользователь нажал отмену или не ввел имя, то выведите сообщение
// "До свидания!" 